library/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "rented" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["rented", true], ["updated_at", "2023-12-04 22:09:31.832695"], ["id", 1]]
INSERT INTO "rentals" ("book_id", "user_id", "rental", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["book_id", 1], ["user_id", 1], ["rental", "2023-12-04 22:09:31 +0000"], ["created_at", "2023-12-04 22:09:32.034034"], ["updated_at", "2023-12-04 22:09:32.034034"]]
---
  def rent
    @book = Book.find(params[:id])

    if !@book.rented
      @book.update(rented: true)

      Rental.create(user_id: current_user.id, book_id: @book.id, rental: Time.now)

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "rented" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["rented", false], ["updated_at", "2023-12-04 22:52:42.957984"], ["id", 5]]
SELECT "rentals".* FROM "rentals" WHERE "rentals"."book_id" = $1  [["book_id", 13]]
DELETE FROM "rentals" WHERE "rentals"."id" = $1  [["id", 8]]
---
  def refund
    @book = Book.find(params[:id])

    if @book.rented
      @book.update(rented: false)

      rentals_to_destroy = Rental.where(book_id: @book.id)
      rentals_to_destroy.destroy_all