library/app/controllers/rentals_controller.rb

  def index
    @rentals = Rental.all
---
SELECT "rentals".* FROM "rentals"