library/app/views/books/index.html.erb

SELECT  "rentals".* FROM "rentals" WHERE "rentals"."book_id" = $1 AND "rentals"."user_id" = $2 LIMIT $3  [["book_id", 20], ["user_id", 1], ["LIMIT", 1]]
---
                <% end %>
                <% if book.rented && book.rentals.find_by(user: current_user)%>